<template>
    <div>
        <h1>Мерчант - Страницы возврата клиента</h1>
        <p>Страницы возврата клиента - Страницы, на которые переадресовывается пользователь после осуществления платежа.</p>
        <p>
            <b>!ВАЖНО!</b> переадресация на SUCCESS URL не гарантирует успешное завершение платежа.
            Перед передачей товара вы должны получить и проверить уведомление от нашей системы.
        </p>
        <p>На эти страницы передаются следующие параметры:</p>
        <ul>
            <li>shop</li>
            <li>payment</li>
            <li>amount</li>
            <li>currency</li>
            <li>uv_*</li>
        </ul><br>
    </div>
</template>

<script>
    export default {
        data() {
            return {
                config: config
            }
        }
    }
</script>
<style>
</style>
