<template>
    <div>
        <h1>Мерчант - Настройка магазина</h1>
        <p>Для того, что бы начать принимать оплату на своем сайте, вам необходимо добавить магазин в разделе "Магазины"</p>
        <h4>Описание настроек магазина</h4>
        <v-data-table
                :headers="tableSettingsHeaders"
                :items="tableSettingsItems"
                hide-actions
                class="elevation-1"
        >
            <template slot="items" slot-scope="props">
                <td>{{ props.item.name }}</td>
                <td v-html="props.item.desc"></td>
            </template>
        </v-data-table><br>

        <p>После того как вы добавили магазин, отправьте его на проверку. Ожидайте изменение статуса магазина</p>
    </div>
</template>
<script>
    export default {
        data() {
            return {
                config: config,
                tableSettingsHeaders: [
                    {text: 'Название', sortable: false, value: 'name'},
                    {text: 'Описание', sortable: false, value: 'desc'},
                ],
                tableSettingsItems: [
                    {name: 'Название', desc: 'Произвольное название вашего магазина'},
                    {name: 'URL', desc: 'Адрес вашего магазина. <b>Внимание!</b> После первого сохранения вы не сможете отредактировать значение этого поля'},
                    {name: 'Описание', desc: 'Краткое описание вашего магазина'},
                    {name: 'Секретная фраза', desc:
                        'Набор цифр и букв в нижнем регистре длиной в 64 символа. Служит для генерации подписи ваших ' +
                        'запросов. После сохранения скрывается и вы не сможете никак его узнать. Если вы потеряли ' +
                        'значение, вы можете ввести новое. Сгенерировать его можно здесь: ' +
                        '<a target="_blank" href="http://www.onlinepasswordgenerator.ru/?value=64&usenums=on&uselower=on">' +
                        'http://www.onlinepasswordgenerator.ru/?value=64&usenums=on&uselower=on</a>'
                    },
                    {name: 'Адрес перенаправления при успешной оплате', desc:
                            'URL-адрес, на который будет перенаправляться покупатель после успешной оплаты. ' +
                            'Домен должен совпадать с указанным в поле URL. <b>Внимание!</b> ' +
                            'Перенаправление не является 100% фактом оплаты. Смотрите раздел "Уведомления"'
                    },
                    {name: 'Адрес перенаправления при ошибке оплаты', desc:
                            'URL-адрес, на который будет перенаправляться покупатель после ошибки оплаты. ' +
                            'Домен должен совпадать с указанным в поле URL.'
                    },
                    {name: 'Адрес отправки уведомлений', desc:
                            'URL-адрес, на который будет отправляться уведомление о оплате. Смотрите раздел "Уведомления" ' +
                            'Домен должен совпадать с указанным в поле URL.'
                    },
                    {name: 'Комиссию оплачивает покупатель', desc:
                            'При установке данного флажка комиссия будет начисляться сверху указанной суммы при ' +
                            'инициализации платежа, ее будет оплачивать покупатель, а на ваш счет будет зачисляться ' +
                            'ровно та сумма, которую вы указали при инициализации. В обратном случае на ваш счет будет ' +
                            'зачислена указанная вами сумма за вычетом комиссии'
                    },
                    {name: 'Тестовый режим', desc:
                            'При установке данного флажка в списке методов оплаты добавится тестовый метод, при выборе ' +
                            'которого платеж сразу перейдет в статус "Оплачено". <b>Внимание! Не включайте этот режим на работающем магазине</b>'
                    },
                    {name: 'Разрешить переопределение URL', desc:
                            'Когда установлен этот флажок, вы можете изменять URL-адреса переадресации клиента после ' +
                            'оплаты. Но только в рамках домена, указанного в поле URL'
                    },
                ],
            }
        },
        components: {
        }
    }
</script>
<style>
</style>
