<template>
    <div>
        <h1>Описание</h1>
        <p>
            Мерчант - интерфейс для приема платежей через интернет.
            Через единую точку входа он позволяет организовать оплату на Вашем сайте множеством платежных систем.
            Имеет простой протокол взаимодействия и легкую интеграцию в новый или уже работающий бизнес.
        </p>
        <p>Для начала работы необходимо сделать несколько шагов:</p>
        <ul>
            <li>зарегистрироваться на сайте {{config.domain}};</li>
            <li>добавить и настроить магазин в разделе Магазины;</li>
            <li>установить на своем сайте HTML-форму для перенаправления на оплату;</li>
        </ul>
        <br>
        <p>
            Воспользуйтесь API для взаимодействия вашего сервиса с нашей платежной системой
        </p>
    </div>
</template>

<script>
    export default {
        data() {
            return {
                config: config
            }
        }
    }
</script>
<style>
</style>
